IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/I2C3_I2C3.xml
	<register id="I2C3_ICCLKL" acronym="I2C3_ICCLKL" offset="0xC" width="32" description="">
		<bitfield id="ICCL15_ICCL0" width="16" begin="15" end="0" resetval="0x0" description="Low time I 2 C SCL Clock Division Factor. They are used to  divide down the master clock to create the SCL low time  transition frequency. This register must be configured while  the I2C is still in reset (IRS_=0)." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICCLKH" acronym="I2C3_ICCLKH" offset="0x10" width="32" description="">
		<bitfield id="ICCH15_ICCLH0" width="16" begin="15" end="0" resetval="0x0" description="High time I 2 C SCL Clock Division Factor. They are used to  divide down the master clock to create the SCL high time  transition frequency. This register must be configured while  the I2C is still in reset (IRS_=0)." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICCNT" acronym="I2C3_ICCNT" offset="0x14" width="32" description="">
		<bitfield id="ICDC15_ICDC0" width="16" begin="15" end="0" resetval="0x0" description="Data count. This data count register is used to generate a  Stop condition if a Stop condition is specified (STP=1). .  ICCNT=1 data count is 1  ::::::::::::::::::::::::::::::::::::::::::::  ::::::::::::::::::::::::::::::::::::::::::::  ICCNT=0FFFFh data count is 65535  ICCNT=0data counter is 65536  Note that ICCNT is a don't care when RM is set to 1." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICDRR" acronym="I2C3_ICDRR" offset="0x18" width="32" description="">
		<bitfield id="D7_D0" width="8" begin="7" end="0" resetval="0x0" description="Receive data" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICSAR" acronym="I2C3_ICSAR" offset="0x1C" width="32" description="">
		<bitfield id="A9_A0" width="10" begin="9" end="0" resetval="0x0" description="Slave address. Use in both 7- and 10-bit address mode." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICDXR" acronym="I2C3_ICDXR" offset="0x20" width="32" description="">
		<bitfield id="D7_D0" width="8" begin="7" end="0" resetval="0x0" description="Transmit data" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICMDR" acronym="I2C3_ICMDR" offset="0x24" width="32" description="">
		<bitfield id="NACKMOD" width="1" begin="15" end="15" resetval="0x0" description="No Acknowledge (NACK) mode.  This bit is used to send an Acknowledge (ACK) or a No  Acknowledge (NACK) to the transmitter. This bit is only  applicable  when the I2C is in receiver mode. In master receiver mode  when  the internal data count counter decrements to zero the I2C  sends a  NACK. The master receiver I2C finishes a transfer when it  sends a  NACK. The I2C ignores ICCNT when NACKMOD is '1'. The  NACKMOD bit should be set before the rising edge of the last  data  bit (bit 8) if a NACK must be sent and this bit is cleared  once a  NACK has been sent.  NACKMOD=0 the I2C sends an ACK to the transmitter during the  acknowledge cycle. NACKMOD=1 the I2C sends a NACK to the transmitter during the  acknowledge cycle." range="15" rwaccess="RW"/> 
		<bitfield id="FREE" width="1" begin="14" end="14" resetval="0x0" description="Free Running.  This bit is used to determine the state of the I2C when a  breakpoint  is encountered in the HLL debugger.  FREE=0: (default) Stops immediately if SCL is low and keep  driving  SCL low whether I2C is master transmitter/receiver. If SCL  is high  I2C waits until SCL becomes low and then stops. If the I2C  is a  slave it will stop when the transmission/receiving  completes.  FREE=1: The I2C runs free." range="14" rwaccess="RW"/> 
		<bitfield id="STT" width="1" begin="13" end="13" resetval="0x0" description="Start Condition (Master only mode).  This bit can be set to a'1' by the CPU to generate a Start  condition.  In master mode when setting Start to'1' generates a Start  condition.  It is reset to '0' by the hardware after the Start condition  has been  generated. The Start/Stop bits can be configured to generate  different transfer formats. Note that the STT and STP can be  used to  terminate the repeat mode.  ____________________________________________________STT___STP____Conditions_______________Bus Activities  _1_____0________Start___________________S-A-D  _0_____1________Stop_____________________P  _1_____1________Start-Stop (ICCNT= n)______S-A-D..(n)..D-P  _1_____0________Start (ICCNT= n)__________S-A-D..(n)..D     ____________________________________________________" range="13" rwaccess="RW"/> 
		<bitfield id="NU1" width="1" begin="12" end="12" resetval="0x0" description="Reserved for IDLEEN (IDLE Enable on 5509). - (RW  )" range="12" rwaccess="RW"/> 
		<bitfield id="STP" width="1" begin="11" end="11" resetval="0x0" description="Stop Condition (Master mode only).  This bit can be set to a'1' by the CPU to generate a Stop  condition.  It is reset to '0' by the hardware after the Stop condition  has been  generated. The Stop condition is generated when ICCNT passes  0  when the I2C is in non-repeat mode(RM=0)." range="11" rwaccess="RW"/> 
		<bitfield id="MST" width="1" begin="10" end="10" resetval="0x0" description="Master.  MST=0: The I 2 C peripheral is in the'slave' mode and clock  is  received from the'master' device.  MST=1: The I 2 C peripheral is in the'master' mode and it  generates  the clock. This bit is clear when the transfer completed." range="10" rwaccess="RW"/> 
		<bitfield id="TRX" width="1" begin="9" end="9" resetval="0x0" description="Transmitter.  TRX=0: The I 2 C is in the'receiver' mode and data on data  line SDA  is shifted into the data register ICDRR.  TRX=1: The I 2 C is in the'transmitter' mode and the data  in ICDXR  is shifted out on data line SDA.  The operating modes (not in FDF mode) are defined as follows.  In FDF mode TRX must be configured even if the I2C is in  slave  mode because there is no address/direction byte in FDF mode.  ______________________________MST___TRX___Operating Modes  _0______x_____'slave receiver'  _0______x_____'slave transmitter'  _1______0_____'master receiver'  _1______1_____'master transmitter'     ______________________________" range="9" rwaccess="RW"/> 
		<bitfield id="XA" width="1" begin="8" end="8" resetval="0x0" description="Expanded Address.  XA=0: (default) 7-bit address mode (normal address mode).  XA=1: 10-bit address mode (expanded address mode)  Please note that XA needs to be configured even if the I2C  is in  slave mode." range="8" rwaccess="RW"/> 
		<bitfield id="RM" width="1" begin="7" end="7" resetval="0x0" description="Repeat Mode.  This bit is set to a'1' by the CPU to put the I2C in the  repeat mode.  In this mode data is continuously transmitted out of the  ICDXR until  the STP bit is set to'1' regardless of ICCNT value. This  bit is don't  care if the I2C is configured in slave mode.  _________________________________________________________RM___STT___STP___Conditions_____Bus Activities_______Mode  _0_____0_____0_______Idle___________None___________NA  _0_____0_____1_______Stop____________P____________NA  _0_____1_____0_____(Re)Start_______S-A-D..(n)..D____Repeat n  _0_____1_____1_____(Re)Start-Stop___S-A-D..(n)..D-P__Repeat n  _1_____0_____0_______Idle___________none___________NA  _1_____0_____1_______Stop____________P  ___________NA  _1_____1_____0_____(Re)Start_______S-A-D-D-D.._____Continuous  _1_____1_____1_____Reserved________None___________NA _________________________________________________________" range="7" rwaccess="RW"/> 
		<bitfield id="DLB" width="1" begin="6" end="6" resetval="0x0" description="Digital Loop Back (in master transmit mode only).  This bit is set to a'1' by the CPU to put the I2C in the  loop back  mode. In this mode data transmitted out of the ICDXR will be  received in the ICDRR after ((CPU freq/I2C freq)8) CPU  cycles via an internal path. The address of the ICOAR is  output on SDA." range="6" rwaccess="RW"/> 
		<bitfield id="IRS" width="1" begin="5" end="5" resetval="0x0" description="I2C Reset Not.  This can be set to a'0' by the CPU to put the I2C in reset  or to a'1'  to take the I2C out of reset. When this bit is reset to 0  all status bits  in ICSTR and ICIVR are set to default values. Note that if  this bit is  reset during a transfer it can cause the I2C bus hang (SDA  and SCL  are tri-stated)." range="5" rwaccess="RW"/> 
		<bitfield id="STB" width="1" begin="4" end="4" resetval="0x0" description="Start Byte (Master only mode).  The Start Byte mode bit is set to 1 by the CPU to configure  the I2C  in Start byte mode the I2C sends '00000001'? regardless ICSAR  value. Refer to the Philip I2C spec for more details." range="4" rwaccess="RW"/> 
		<bitfield id="FDF" width="1" begin="3" end="3" resetval="0x0" description="Free Data Format.  This bit can be set to'1' by the CPU to configure the I2C  in Free  Data Format mode.  ______________________________________________FDF___MST___TRX______Operating mode _0______0_____ x____Slave in non FDF mode  _0______1_____0____Master receive in non FDF mode  _0______1_____1____Master transmit in non FDF mode  _1______0_____0____Slave receiver in FDF mode  _1______0_____1____Slave transmitter in FDF mode  _1______1_____0____Master receiver in FDF mode  _1______1_____1____Master transmitter in FDF mode  ______________________________________________" range="3" rwaccess="RW"/> 
		<bitfield id="BC2_BC1_BC0" width="3" begin="2" end="0" resetval="0x0" description="Bit Count : Bit Count 2, Bit Count 1 and Bit Count 0 define  the  number of bits starting from the lsb (excluding the  acknowledge bit)  of the next byte which are yet to be received or transmitted.  __________________________________________BC2_BC1_BC0__Bits/byte in FDF__Bits/byte w/ ACK  _0___0___1_____NA (reserved)____ NA (reserved)  _0___1___0________2______________3_______ _0___1___1________3______________4_______  _1___0___0________4______________5_______  _1___0___1________5______________6_______  _1___1___0________6______________7_______  _1___1___1________7______________8_______  _0___0___0________8______________9_______ __________________________________________" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICIVR" acronym="I2C3_ICIVR" offset="0x28" width="32" description="">
		<bitfield id="NU2" width="20" begin="31" end="12" resetval="0x0" description="Reserved." range="31 - 12" rwaccess="RW"/> 
		<bitfield id="TESTMD" width="4" begin="11" end="8" resetval="0x0" description="Reserved for internal testing." range="11 - 8" rwaccess="RW"/> 
		<bitfield id="NU1" width="5" begin="7" end="3" resetval="0x0" description="Reserved." range="7 - 3" rwaccess="RW"/> 
		<bitfield id="INTCODE" width="3" begin="2" end="0" resetval="0x0" description="Interrupt code.  The binary-coded-interrupt vector indicates which interrupt  has  occurred. Reading the ICIVR clears the interrupt code except  ARDY(011) RRDY(100) and XRDY(101). Interrupt code for ARDY  RRDY and XRDY is cleared when ARDY ICRRDY and ICXRDY  bits in the ICSTR is cleared to default value respectively.  If other  interrupts are pending a new interrupt is generated. If  there are  more than one interrupt flag reading the ICIVR clears the  highest  priority interrupt code.  Reading the ICIVR also clears corresponding status bit in the  ICSTR except ARDY ICRRDY ICXRDY and AAS.  Note that users must read (clear) the ICIVR before doing  another  start otherwise the ICIVR could contain incorrect (old  interrupt flags)  value.  ________________________________________________Interrupt Code____________Interrupt Occurred___________000_(default)_________________None  _001_(highest priority)____Arbitration Lost interrupt  _010__________________No Acknowledgement interrupt  _011__________________Register Access Ready interrupt  _100__________________Receive Data Ready interrupt  _101__________________Transmit Data Ready interrupt  _110__________________Stop Condition Detection  _111_(lowest priority)_____Address As Slave - (RW)  ________________________________________________" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICEMDR" acronym="I2C3_ICEMDR" offset="0x2C" width="32" description="">
		<bitfield id="NU" width="30" begin="31" end="2" resetval="0x0" description="Reserved. - (RW  )" range="31 - 2" rwaccess="RW"/> 
		<bitfield id="IGNACK" width="1" begin="1" end="1" resetval="0x0" description="Ignore NACK mode  IGNACK=0 The master transmitter will operate normally  discontinue the data transfer and set the ARDY and NACK  status bits when a NACK signal is received from the slave.  IGNACK=1 The master transmitter will ignore a NACK  received from the slave." range="1" rwaccess="RW"/> 
		<bitfield id="BCM" width="1" begin="0" end="0" resetval="0x0" description="Backward Compatibility Mode.  This bit affects the I2C interrupt behavior. Refer to  appendix A  for details." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C3_ICPSC" acronym="I2C3_ICPSC" offset="0x30" width="32" description="">
		<bitfield id="NU" width="24" begin="31" end="8" resetval="0x0" description="Reserved." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="IPSC7_IPSC0" width="8" begin="7" end="0" resetval="0x0" description="8-bit prescaler to divide the system clock down to 4/8/12Mhz  clock and used by the I2C module. This register must be  initialized while the I2C is still in reset (IRS_=0). The  value takes  effect on the rising edge of IRS_." range="7 - 0" rwaccess="RW"/>
	</register>
